//7_9.cpp  文件三，主函数
#include "linequ.h"	//类声明头文件
int main()	//主函数
{
    double a[]=	//方程系数矩阵
	{
		0.2368,0.2471,0.2568,1.2671,	//第一行
		0.1968,0.2071,1.2168,0.2271,	//第二行
		0.1581,1.1675,0.1768,0.1871,	//第三行
		1.1161,0.1254,0.1397,0.1490};	//第四行
		double b[4]=	//方程右端项
		{1.8471,1.7471,1.6471,1.5471};
		Linequ equ1(4);	//定义一个四元方程组对象
		equ1.setLinequ(a,b);	//设置方程组
		equ1.printL();	//输出方程组
		if(equ1.Solve())	//求解方程组
			equ1.showX();	//输出方程组的解
		else
			cout<<"Fail"<<endl;
}
//End of file lequmain.cpp
